Reading Input.md.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2026-01-31 Sat 10:08 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="author" content="Michael Leibbrandt" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#scanner">1. Scanner</a>
<ul>
<li><a href="#org4106b21">1.1. Output</a></li>
<li><a href="#org5c1ea6f">1.2. Input</a>
<ul>
<li><a href="#org083b74d">1.2.1. Steps to use Scanner</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-scanner" class="outline-2">
<h2 id="scanner"><span class="section-number-2">1.</span> Scanner</h2>
<div class="outline-text-2" id="text-scanner">
<p>
Java provides various ways to handle <code>input/output (I/O)</code>.
</p>
<ul class="org-ul">
<li><code>Scanner</code> class for <b>input</b></li>
<li><code>System.out</code> for <b>output</b></li>
</ul>
</div>

<div id="outline-container-org4106b21" class="outline-3">
<h3 id="org4106b21"><span class="section-number-3">1.1.</span> Output</h3>
<div class="outline-text-3" id="text-1-1">
<p>
The <code>System.out.println</code> method is used to print <b>text</b> to the <b>console</b>.
</p>

<p>
Example:
</p>

<p>
<code>System.out.println("Hello, World!");</code>
</p>

<p>
Now, how can we capture input from the user?
</p>
</div>
</div>

<div id="outline-container-org5c1ea6f" class="outline-3">
<h3 id="org5c1ea6f"><span class="section-number-3">1.2.</span> Input</h3>
<div class="outline-text-3" id="text-1-2">
<p>
The <code>Scanner</code> class is used to <b>read</b> <b>input</b>.
</p>
</div>

<div id="outline-container-org083b74d" class="outline-4">
<h4 id="org083b74d"><span class="section-number-4">1.2.1.</span> Steps to use Scanner</h4>
<div class="outline-text-4" id="text-1-2-1">
<ul class="org-ul">
<li>Import the <code>Scanner</code> class. <code>import java.util.Scanner;</code></li>
<li>Create a <code>Scanner</code> object. <code>Scanner scanner = new Scanner(System.in);</code></li>
</ul>

<div class="org-src-container">
<pre class="src src-java">import java.util.Locale;
import java.util.Scanner;

public class ScannerExample {
    public static void main(String[] args) {
        Scanner sc = new Scanner(System.in);
        sc.useLocale(Locale.US);

        // Reading different types of inputs
        System.out.println("Enter a string:");
        String str = sc.nextLine(); // Reads a whole line

        System.out.println("Enter an integer:");
        int number = sc.nextInt(); // Reads an integer
        sc.nextLine();

        System.out.println("Enter a float:");
        float decimal = sc.nextFloat(); // Reads a float

        System.out.println("Enter a boolean (true/false):");
        boolean flag = sc.nextBoolean(); // Reads a boolean

        // Output
        System.out.println("String: " + str);
        System.out.println("Integer: " + number);
        System.out.println("Float: " + decimal);
        System.out.println("Boolean: " + flag);

        sc.close(); // Close the scanner to free resources
    }
}
</pre>
</div>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Method</th>
<th scope="col" class="org-left">Description</th>
<th scope="col" class="org-left">Example Usage</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">next()</td>
<td class="org-left">Reads the next token (word) separated by whitespace.</td>
<td class="org-left">String word = sc.next();</td>
</tr>

<tr>
<td class="org-left">nextLine()</td>
<td class="org-left">Reads the entire line of input (including spaces).</td>
<td class="org-left">String line = sc.nextLine();</td>
</tr>

<tr>
<td class="org-left">nextInt()</td>
<td class="org-left">Reads the next integer value.</td>
<td class="org-left">int num = sc.nextInt();</td>
</tr>

<tr>
<td class="org-left">nextFloat()</td>
<td class="org-left">Reads the next float value.</td>
<td class="org-left">float num = sc.nextFloat();</td>
</tr>

<tr>
<td class="org-left">nextDouble()</td>
<td class="org-left">Reads the next double value.</td>
<td class="org-left">double num = sc.nextDouble();</td>
</tr>

<tr>
<td class="org-left">nextBoolean()</td>
<td class="org-left">Reads the next boolean value (true or false).</td>
<td class="org-left">boolean flag = sc.nextBoolean();</td>
</tr>

<tr>
<td class="org-left">nextByte()</td>
<td class="org-left">Reads the next byte value.</td>
<td class="org-left">byte b = sc.nextByte();</td>
</tr>

<tr>
<td class="org-left">nextShort()</td>
<td class="org-left">Reads the next short value.</td>
<td class="org-left">short s = sc.nextShort();</td>
</tr>

<tr>
<td class="org-left">nextLong()</td>
<td class="org-left">Reads the next long value.</td>
<td class="org-left">long l = sc.nextLong();</td>
</tr>

<tr>
<td class="org-left">hasNext()</td>
<td class="org-left">Checks if there’s another token available.</td>
<td class="org-left">if (sc.hasNext()) { String input = sc.next(); }</td>
</tr>

<tr>
<td class="org-left">hasNextInt()</td>
<td class="org-left">Checks if the next token is an integer.</td>
<td class="org-left">if (sc.hasNextInt()) { int num = sc.nextInt(); }</td>
</tr>

<tr>
<td class="org-left">hasNextFloat()</td>
<td class="org-left">Checks if the next token is a float.</td>
<td class="org-left">if (sc.hasNextFloat()) { float f = sc.nextFloat();}</td>
</tr>

<tr>
<td class="org-left">hasNextDouble()</td>
<td class="org-left">Checks if the next token is a double.</td>
<td class="org-left">if (sc.hasNextDouble()) { double d = sc.nextDouble();}</td>
</tr>

<tr>
<td class="org-left">hasNextBoolean()</td>
<td class="org-left">Checks if the next token is a boolean.</td>
<td class="org-left">if (sc.hasNextBoolean()) { boolean b = sc.nextBoolean();}</td>
</tr>

<tr>
<td class="org-left">useDelimiter(String p)</td>
<td class="org-left">Sets a custom delimiter (default is whitespace).</td>
<td class="org-left">sc.useDelimiter(",");</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>
</div>
</div>
</body>
</html>
